Revit 2027 API
BaseArray.Label Property
The family parameter label of the BaseArray.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 27.0.4.0 (27.0.4.0)
Syntax
public FamilyParameter Label { get; set; }
Public Property Label As FamilyParameter
	Get
	Set
public:
property FamilyParameter^ Label {
	FamilyParameter^ get ();
	void set (FamilyParameter^ value);
}
member Label : FamilyParameter with get, set
Property Value
FamilyParameter
Exceptions
Exception | Condition
ArgumentException |  Thrown when the family parameter's ParameterType is not ParameterType.Integer.
InvalidOperationException |  Thrown when trying to label the BaseArray out of family document.
Remarks
 The label associates the number of members of the array with a family parameter. A BaseArray only can be labeled in a family document and only can be labeled to a integer FamilyParameter. To unbind the family parameter, set this property to null.
See Also
Reference
BaseArray Class
Autodesk.Revit.DB Namespace